Documents/НастройкаКонтроляМатериаловВПроизводстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>НастройкаКонтроляМатериаловВПроизводстве</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокументаКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовКонтроляМатериаловВПроизводстве</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролироватьКоличество</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролироватьВыработку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПопозиционныйКонтроль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролироватьКоличество</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролироватьВыработку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПопозиционныйКонтроль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыДокументовКонтроляМатериаловВПроизводстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДокументовКонтроляМатериаловВПроизводстве</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыпускПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НастройкаКонтроляМатериаловВПроизводстве/Ext/ManagerModule.bsl
#Область ОбработчикиОбновления

//++ №14311 на каждую организацию, у которой есть хотя бы один документ ЗП, ЗНП или Выпуск продукции создается новый документ "Настройка контроля материалов в производстве"
Процедура СоздатьНовыеДокументы() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПокупателя.Организация КАК Организация
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	НЕ ЗаказПокупателя.Организация = Значение(Справочник.Организации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказНаПроизводство.Организация КАК Организация
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	НЕ ЗаказНаПроизводство.Организация = Значение(Справочник.Организации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыпускПродукции.Организация КАК Организация
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	НЕ ВыпускПродукции.Организация = Значение(Справочник.Организации.ПустаяСсылка)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВидовНоменклатуры = новый Массив;
	МассивВидовНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.Продукция);
	МассивВидовНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.Материал);
	МассивВидовНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.Полотно);
	
	Пока Выборка.Следующий() Цикл
		
		// Один документ для ЗнП, другой для выпуска
		Для Сч = 1 По 2 Цикл
			
			ДокументОбъект = Документы.НастройкаКонтроляМатериаловВПроизводстве.СоздатьДокумент();
			ДокументОбъект.Заполнить(Неопределено);
			
			ДокументОбъект.Дата = Дата(2001, 01, 01);
			ДокументОбъект.Организация = Выборка.Организация;
			
			ДокументОбъект.ВидДокументаКонтроля = Перечисления.ВидыДокументовКонтроляМатериаловВПроизводстве[?(Сч = 1, "ЗаказНаПроизводство", "ВыпускПродукции")];
			
			// Заполняем ТЧ "Вид номенклатуры"
			Для Каждого ВидНоменклатуры Из МассивВидовНоменклатуры Цикл
				
				НоваяСтрока = ДокументОбъект.ВидНоменклатуры.Добавить();
				
				НоваяСтрока.ВидНоменклатуры = ВидНоменклатуры;
				
				// ставим все галочки для вида контролируемого документа ЗНП и только галочка "контролировать выработку" для вида документа "Выпуск"
				Если ДокументОбъект.ВидДокументаКонтроля = Перечисления.ВидыДокументовКонтроляМатериаловВПроизводстве.ЗаказНаПроизводство Тогда
					
					НоваяСтрока.КонтролироватьВыработку 	= Истина;
					НоваяСтрока.КонтролироватьКоличество 	= Истина;
					НоваяСтрока.ПопозиционныйКонтроль 		= Истина;
					
				Иначе
					
					НоваяСтрока.КонтролироватьВыработку		= Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить("Не удалось создать документ ""Настройка контроля материалов в производстве"" для организации " 
					+ Выборка.Организация + ", для контроля по документу " + ДокументОбъект.ВидДокументаКонтроля + Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
//-- №14311

#КонецОбласти
